In [314]:
import pandas as pd

### Data Source [515K Hotel Reviews](https://www.kaggle.com/jiashenliu/515k-hotel-reviews-data-in-europe)

In [315]:
df = pd.read_csv('Hotel_Reviews.csv')

In [316]:
df.head()

,Hotel_Address,Additional_Number_of_Scoring,Review_Date,Average_Score,Hotel_Name,Reviewer_Nationality,Negative_Review,Review_Total_Negative_Word_Counts,Total_Number_of_Reviews,Positive_Review,Review_Total_Positive_Word_Counts,Total_Number_of_Reviews_Reviewer_Has_Given,Reviewer_Score,Tags,days_since_review,lat,lng
0,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,8/3/2017,7.7,Hotel Arena,Russia,I am so angry that i made this post available...,397,1403,Only the park outside of the hotel was beauti...,11,7,2.9,"[' Leisure trip ', ' Couple ', ' Duplex Double...",0 days,52.360576,4.915968
1,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,8/3/2017,7.7,Hotel Arena,Ireland,No Negative,0,1403,No real complaints the hotel was great great ...,105,7,7.5,"[' Leisure trip ', ' Couple ', ' Duplex Double...",0 days,52.360576,4.915968
2,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,7/31/2017,7.7,Hotel Arena,Australia,Rooms are nice but for elderly a bit difficul...,42,1403,Location was good and staff were ok It is cut...,21,9,7.1,"[' Leisure trip ', ' Family with young childre...",3 days,52.360576,4.915968
3,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,7/31/2017,7.7,Hotel Arena,United Kingdom,My room was dirty and I was afraid to walk ba...,210,1403,Great location in nice surroundings the bar a...,26,1,3.8,"[' Leisure trip ', ' Solo traveler ', ' Duplex...",3 days,52.360576,4.915968
4,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,7/24/2017,7.7,Hotel Arena,New Zealand,You When I booked with your company on line y...,140,1403,Amazing location and building Romantic setting,8,3,6.7,"[' Leisure trip ', ' Couple ', ' Suite ', ' St...",10 days,52.360576,4.915968

In [317]:
for col in df.columns:
    print(col)

Hotel_Address
Additional_Number_of_Scoring
Review_Date
Average_Score
Hotel_Name
Reviewer_Nationality
Negative_Review
Review_Total_Negative_Word_Counts
Total_Number_of_Reviews
Positive_Review
Review_Total_Positive_Word_Counts
Total_Number_of_Reviews_Reviewer_Has_Given
Reviewer_Score
Tags
days_since_review
lat
lng

In [318]:
hotels_unique = df.drop_duplicates(subset='Hotel_Address', keep='first')

In [319]:
hotels_unique.shape

(1493, 17)

In [320]:
add_numeric = []

In [321]:
addresses = hotels_unique.Hotel_Address
for address in addresses:
    if "United Kingdom" in address:
        add_numeric.append(0)
    elif "France" in address:
        add_numeric.append(1)
    elif "Italy" in address:
        add_numeric.append(2)
    elif "Spain" in address:
        add_numeric.append(3)
    elif "Austria" in address:
        add_numeric.append(4)
    elif "Netherlands" in address:
        add_numeric.append(5)

In [322]:
hotels_unique['country'] = add_numeric

<ipython-input-322-ce9dbd65ef2c>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  hotels_unique['country'] = add_numeric

In [323]:
hotels_unique.head()

,Hotel_Address,Additional_Number_of_Scoring,Review_Date,Average_Score,Hotel_Name,Reviewer_Nationality,Negative_Review,Review_Total_Negative_Word_Counts,Total_Number_of_Reviews,Positive_Review,Review_Total_Positive_Word_Counts,Total_Number_of_Reviews_Reviewer_Has_Given,Reviewer_Score,Tags,days_since_review,lat,lng,country
0,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,8/3/2017,7.7,Hotel Arena,Russia,I am so angry that i made this post available...,397,1403,Only the park outside of the hotel was beauti...,11,7,2.9,"[' Leisure trip ', ' Couple ', ' Duplex Double...",0 days,52.360576,4.915968,5
405,1 15 Templeton Place Earl s Court Kensington a...,244,8/3/2017,8.5,K K Hotel George,Ireland,Really nothing negative to say about this hotel,9,1831,Very comfortable beds smart bathroom good sho...,18,2,9.6,"[' Leisure trip ', ' Group ', ' Classic Twin R...",0 days,51.491888,-0.194971,0
971,1 2 Serjeant s Inn Fleet Street City of London...,639,8/2/2017,9.2,Apex Temple Court Hotel,United Kingdom,Difficult to locate the phone to contact rece...,20,2619,They have followed through special requests C...,17,1,9.2,"[' Leisure trip ', ' Couple ', ' Deluxe King R...",1 days,51.513734,-0.108751,0
2008,1 3 Queens Garden Westminster Borough London W...,1058,8/2/2017,7.7,The Park Grand London Paddington,Cyprus,The first night we were given an extremely sm...,30,4380,The size of the room,6,6,8.3,"[' Family with young children ', ' Triple Room...",1 days,51.514218,-0.180903,0
3778,1 3 Rue d Argentine 16th arr 75116 Paris France,26,6/29/2017,8.4,Monhotel Lounge SPA,Brazil,No Negative,0,171,Nice hotel Room was beautiful and bed very co...,231,1,9.2,"[' Leisure trip ', ' Group ', ' Comfort Double...",35 days,48.874348,2.289733,1

In [324]:
hotels_unique.drop(['Hotel_Address', 'Review_Date','Review_Total_Negative_Word_Counts','Review_Total_Positive_Word_Counts','days_since_review','Additional_Number_of_Scoring','Total_Number_of_Reviews_Reviewer_Has_Given','Positive_Review','Negative_Review','Reviewer_Nationality','Reviewer_Score'], axis=1, inplace=True)

C:\Users\Hi\anaconda3\lib\site-packages\pandas\core\frame.py:4163: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [325]:
hotels_unique.columns

Index(['Average_Score', 'Hotel_Name', 'Total_Number_of_Reviews', 'Tags', 'lat',
       'lng', 'country'],
      dtype='object')

In [326]:
hotels_unique.columns = ['avg_score', 'name', 'total_reviews', 'tags', 'lat', 'lng', 'country']

In [327]:
hotels_unique.head()

,avg_score,name,total_reviews,tags,lat,lng,country
0,7.7,Hotel Arena,1403,"[' Leisure trip ', ' Couple ', ' Duplex Double...",52.360576,4.915968,5
405,8.5,K K Hotel George,1831,"[' Leisure trip ', ' Group ', ' Classic Twin R...",51.491888,-0.194971,0
971,9.2,Apex Temple Court Hotel,2619,"[' Leisure trip ', ' Couple ', ' Deluxe King R...",51.513734,-0.108751,0
2008,7.7,The Park Grand London Paddington,4380,"[' Family with young children ', ' Triple Room...",51.514218,-0.180903,0
3778,8.4,Monhotel Lounge SPA,171,"[' Leisure trip ', ' Group ', ' Comfort Double...",48.874348,2.289733,1

In [328]:
hotels_unique.shape

(1493, 7)

In [329]:
hotels_unique[pd.isnull(hotels_unique).any(axis=1)]

,avg_score,name,total_reviews,tags,lat,lng,country
99488,7.8,Mercure Paris Gare Montparnasse,377,"[' Leisure trip ', ' Couple ', ' Standard Room...",NaN,NaN,1
116738,8.3,Holiday Inn Paris Montmartre,298,"[' Leisure trip ', ' Group ', ' Triple Room wi...",NaN,NaN,1
177657,8.8,Maison Albar Hotel Paris Op ra Diamond,1524,"[' Leisure trip ', ' Couple ', ' Superior Doub...",NaN,NaN,1
282265,8.9,NH Collection Barcelona Podium,883,"[' Leisure trip ', ' Couple ', ' Premium Doubl...",NaN,NaN,3
327680,8.0,City Hotel Deutschmeister,675,"[' Leisure trip ', ' Couple ', ' Double Room '...",NaN,NaN,4
338919,8.6,Hotel Park Villa,564,"[' Leisure trip ', ' Couple ', ' Standard Doub...",NaN,NaN,4
351449,8.3,Fleming s Selection Hotel Wien City,3672,"[' Leisure trip ', ' Couple ', ' Deluxe Double...",NaN,NaN,4
352107,8.4,Cordial Theaterhotel Wien,422,"[' Leisure trip ', ' Couple ', ' Double Room '...",NaN,NaN,4
365418,8.5,Hotel Daniel Vienna,1405,"[' Leisure trip ', ' Couple ', ' Standard Doub...",NaN,NaN,4
395735,8.1,Roomz Vienna,568,"[' Leisure trip ', ' Family with young childre...",NaN,NaN,4
401983,7.6,Renaissance Barcelona Hotel,104,"[' Leisure trip ', ' Family with young childre...",NaN,NaN,3
440791,8.3,Austria Trend Hotel Schloss Wilhelminenberg Wien,1558,"[' Leisure trip ', ' Group ', ' Classic Room '...",NaN,NaN,4
449422,8.3,Hotel Advance,156,"[' Leisure trip ', ' Couple ', ' Double or Twi...",NaN,NaN,3
449450,8.0,Derag Livinghotel Kaiser Franz Joseph Vienna,1496,"[' Leisure trip ', ' Couple ', ' Economy Plus ...",NaN,NaN,4
465289,8.6,Hotel City Central,2923,"[' With a pet ', ' Leisure trip ', ' Couple ',...",NaN,NaN,4
499956,8.0,Hotel Pension Baron am Schottentor,1315,"[' Leisure trip ', ' Group ', ' Standard Doubl...",NaN,NaN,4
500179,7.8,Hotel Atlanta,2724,"[' Leisure trip ', ' Group ', ' Double or Twin...",NaN,NaN,4

In [330]:
hotels_unique.dropna(inplace=True)

<ipython-input-330-c466aab6c8c5>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  hotels_unique.dropna(inplace=True)

In [331]:
hotels_unique.shape

(1476, 7)

In [332]:
leisure = hotels_unique[hotels_unique.tags.str.contains('Leisure')].groupby('name')['name'].count().sort_values(ascending=False)
leisure

name
pentahotel Vienna                         1
H tel Th r se                             1
H10 Port Vell 4 Sup                       1
H10 Universitat                           1
H10 Urquinaona Plaza                      1
                                         ..
Mercure Paris Pigalle Sacre Coeur         1
Mercure Paris Porte De Versailles Expo    1
Mercure Paris Porte d Orleans             1
Mercure Paris Terminus Nord               1
11 Cadogan Gardens                        1
Name: name, Length: 1290, dtype: int64

In [333]:
business = hotels_unique[hotels_unique.tags.str.contains('Business')].groupby('name')['name'].count().sort_values(ascending=False)
business

name
Hotel Regina                                     2
Worldhotel Cristoforo Colombo                    1
Hallmark Hotel London Chigwell Prince Regent     1
Hotel 55                                         1
Holiday Inn London Brent Cross                   1
                                                ..
Mercure Milano Regency                           1
Mercure London Hyde Park                         1
Mercure Hotel Amsterdam Centre Canal District    1
Melia Paris Vendome                              1
AC Hotel Irla a Marriott Lifestyle Hotel         1
Name: name, Length: 156, dtype: int64

In [334]:
solo = hotels_unique[hotels_unique.tags.str.contains('Solo')].groupby('name')['name'].count().sort_values(ascending=False)
solo

name
Hotel Regina                                2
citizenM Tower of London                    1
H tel de Jos phine BONAPARTE                1
Hotel 4 Barcelona                           1
Holiday Inn Paris Gare de l Est             1
                                           ..
Mercure Paris 17 me Saint Lazare Monceau    1
Mercure Milano Regency                      1
Mercure London Paddington Hotel             1
Mercure London Kensington Hotel             1
25hours Hotel beim MuseumsQuartier          1
Name: name, Length: 239, dtype: int64

In [335]:
couple = hotels_unique[hotels_unique.tags.str.contains('Couple')].groupby('name')['name'].count().sort_values(ascending=False)
couple

name
pentahotel Vienna                          1
H10 Universitat                            1
Hilton Garden Inn Milan North              1
Hilton Barcelona                           1
Hazlitt s                                  1
                                          ..
Mercure Secession Wien                     1
Mercure Paris Tour Eiffel Pont Mirabeau    1
Mercure Paris Terminus Nord                1
Mercure Paris Porte d Orleans              1
11 Cadogan Gardens                         1
Name: name, Length: 680, dtype: int64

In [336]:
group = hotels_unique[hotels_unique.tags.str.contains('Group')].groupby('name')['name'].count().sort_values(ascending=False)
group

name
art otel Amsterdam                                  1
H tel Th r se                                       1
Hilton London Euston                                1
Hilton London Angel Islington                       1
Henry VIII                                          1
                                                   ..
Le Grey Hotel                                       1
Lancaster London                                    1
LaGare Hotel Milano Centrale MGallery by Sofitel    1
La Villa des Ternes                                 1
AC Hotel Milano a Marriott Lifestyle Hotel          1
Name: name, Length: 220, dtype: int64

In [337]:
children = hotels_unique[hotels_unique.tags.str.contains('children')].groupby('name')['name'].count().sort_values(ascending=False)
children

name
Zenit Borrell                             1
Hotel Atmospheres                         1
H10 Urquinaona Plaza                      1
Ham Yard Hotel                            1
Haymarket Hotel                           1
                                         ..
Mercure Paris Porte De Versailles Expo    1
Milan Marriott Hotel                      1
Milan Suite Hotel                         1
Millennium Gloucester Hotel London        1
88 Studios                                1
Name: name, Length: 325, dtype: int64

In [338]:
queen = hotels_unique[hotels_unique.tags.str.contains('Queen')].groupby('name')['name'].count().sort_values(ascending=False)
queen

name
Warwick Paris Former Warwick Champs Elysees               1
London Hilton on Park Lane                                1
Hotel Stendhal Place Vend me Paris MGallery by Sofitel    1
Hotel Indigo London Kensington                            1
Hotel Dupond Smith                                        1
Holiday Inn London Stratford City                         1
Hilton London Hyde Park                                   1
Hilton Garden Inn Vienna South                            1
Hampton by Hilton Amsterdam Centre East                   1
H tel L Echiquier Op ra Paris MGallery by Sofitel         1
Four Seasons Hotel Milano                                 1
Doubletree by Hilton London Kensington                    1
DoubleTree by Hilton London Westminster                   1
DoubleTree by Hilton London Docklands Riverside           1
DoubleTree by Hilton Hotel London Marble Arch             1
DoubleTree by Hilton Hotel Amsterdam NDSM Wharf           1
DoubleTree By Hilton London Excel                         1
Crowne Plaza London Docklands                             1
Courthouse Hotel London                                   1
Club Quarters Hotel St Paul s                             1
Club Quarters Hotel Lincoln s Inn Fields                  1
Club Quarters Hotel Gracechurch                           1
Claridge s                                                1
Bulgari Hotel Milano                                      1
Bentley London                                            1
Ashburn Hotel                                             1
45 Park Lane Dorchester Collection                        1
Le Dokhan s a Tribute Portfolio Hotel                     1
London Marriott Hotel Kensington                          1
The Waldorf Hilton                                        1
Mercure London Bridge                                     1
The Pillar Hotel                                          1
The May Fair Hotel                                        1
The Grand at Trafalgar Square                             1
The Goring                                                1
St Ermin s Hotel Autograph Collection                     1
Sofitel Paris Le Faubourg                                 1
Sofitel Paris Arc De Triomphe                             1
Sofitel Legend The Grand Amsterdam                        1
Room Mate Aitana                                          1
Renaissance Paris Vendome Hotel                           1
Renaissance Paris Republique Hotel Spa                    1
Ramada Apollo Amsterdam Centre                            1
Phileas Hotel                                             1
Novotel Paris Gare De Lyon                                1
Novotel Paris 17                                          1
Novotel London Waterloo                                   1
Novotel London Tower Bridge                               1
Novotel London Paddington                                 1
Novotel London Excel                                      1
Novotel London Blackfriars                                1
Novotel Amsterdam City                                    1
Milestone Hotel Kensington                                1
Milan Marriott Hotel                                      1
Mercure Paris Porte De Versailles Expo                    1
Mercure Milano Regency                                    1
11 Cadogan Gardens                                        1
Name: name, dtype: int64

In [339]:
king = hotels_unique[hotels_unique.tags.str.contains('King')].groupby('name')['name'].count().sort_values(ascending=False)
king

name
Waldorf Astoria Amsterdam                 1
Hyatt Regency Paris Etoile                1
Four Seasons Hotel George V Paris         1
Four Seasons Hotel London at Park Lane    1
Grosvenor House A JW Marriott Hotel       1
                                         ..
Pestana Chelsea Bridge Hotel Spa          1
Portobello House                          1
Pullman Paris Tour Eiffel                 1
Radisson Blu Edwardian Grafton            1
41                                        1
Name: name, Length: 81, dtype: int64

In [340]:
final_hotels = hotels_unique.copy().drop_duplicates(subset=['name', 'country'], inplace=False)
final_hotels.drop(['tags'], axis=1, inplace=True)

In [341]:
final_hotels.head()

,avg_score,name,total_reviews,lat,lng,country
0,7.7,Hotel Arena,1403,52.360576,4.915968,5
405,8.5,K K Hotel George,1831,51.491888,-0.194971,0
971,9.2,Apex Temple Court Hotel,2619,51.513734,-0.108751,0
2008,7.7,The Park Grand London Paddington,4380,51.514218,-0.180903,0
3778,8.4,Monhotel Lounge SPA,171,48.874348,2.289733,1

In [342]:
final_hotels.shape

(1476, 6)

In [343]:
final_hotels.insert(final_hotels.shape[1], 'Business', 0)
final_hotels.insert(final_hotels.shape[1], 'Leisure', 0)
final_hotels.insert(final_hotels.shape[1], 'Solo', 0)
final_hotels.insert(final_hotels.shape[1], 'Couple', 0)
final_hotels.insert(final_hotels.shape[1], 'Group', 0)
final_hotels.insert(final_hotels.shape[1], 'Children', 0)
final_hotels.insert(final_hotels.shape[1], 'QueenBed', 0)
final_hotels.insert(final_hotels.shape[1], 'KingBed', 0)

In [344]:
for hotel in final_hotels.name:
    idx = final_hotels.index[hotels_unique['name'] == hotel]
    if hotel in business:
        final_hotels.at[idx, 'Business'] = 1
    if hotel in leisure:
        final_hotels.at[idx, 'Leisure'] = 1
    if hotel in solo:
        final_hotels.at[idx, 'Solo'] = 1
    if hotel in couple:
        final_hotels.at[idx, 'Couple'] = 1
    if hotel in group:
        final_hotels.at[idx, 'Group'] = 1
    if hotel in children:
        final_hotels.at[idx, 'Children'] = 1
    if hotel in queen:
        final_hotels.at[idx, 'QueenBed'] = 1
    if hotel in king:
        final_hotels.at[idx, 'KingBed'] = 1
final_hotels

,avg_score,name,total_reviews,lat,lng,country,Business,Leisure,Solo,Couple,Group,Children,QueenBed,KingBed
0,7.7,Hotel Arena,1403,52.360576,4.915968,5,0,1,0,1,0,0,0,0
405,8.5,K K Hotel George,1831,51.491888,-0.194971,0,0,1,0,0,1,0,0,0
971,9.2,Apex Temple Court Hotel,2619,51.513734,-0.108751,0,0,1,0,1,0,0,0,1
2008,7.7,The Park Grand London Paddington,4380,51.514218,-0.180903,0,0,0,0,0,0,1,0,0
3778,8.4,Monhotel Lounge SPA,171,48.874348,2.289733,1,0,1,0,0,1,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
511962,8.0,Suite Hotel 900 m zur Oper,3461,48.193523,16.366915,4,1,0,1,0,0,0,0,0
512401,8.9,Hotel Amadeus,717,48.210447,16.371578,4,0,1,1,0,0,0,0,0
512545,9.1,The Berkeley,232,51.502091,-0.157780,0,0,1,0,1,0,0,0,1
512645,7.8,Holiday Inn London Kensington,5945,51.499981,-0.192879,0,0,1,0,1,0,0,0,0
515413,8.1,Atlantis Hotel Vienna,2823,48.203745,16.335677,4,0,1,0,0,0,1,0,0

In [345]:
final_hotels[['Business', 'Leisure', 'Solo', 'Couple', 'Group', 'Children', 'QueenBed', 'KingBed']].sum()

Business     158
Leisure     1292
Solo         241
Couple       682
Group        220
Children     325
QueenBed      57
KingBed       81
dtype: int64

In [346]:
from sklearn.metrics.pairwise import cosine_similarity, linear_kernel

In [347]:
tagsDF = pd.DataFrame(index=['tags'], columns=['Business', 'Leisure', 'Solo', 'Couple', 'Group', 'Children', 'QueenBed', 'KingBed'])
tagsDF.loc['tags'] = [1, 0, 1, 0, 0, 0, 0, 1]
tagsDF

     Business Leisure Solo Couple Group Children QueenBed KingBed
tags        1       0    1      0     0        0        0       1

In [348]:
similarity = cosine_similarity(final_hotels[['Business', 'Leisure', 'Solo', 'Couple', 'Group', 'Children', 'QueenBed', 'KingBed']], tagsDF)

In [349]:
final_hotels.drop(['Business', 'Leisure', 'Solo', 'Couple', 'Group', 'Children', 'QueenBed', 'KingBed'], axis=1, inplace=True)
final_hotels['tag_similarity'] = similarity

## Tag based similarity

In [350]:
final_hotels.sort_values(by=['tag_similarity', 'avg_score'], ascending=False).head(10)

,avg_score,name,total_reviews,lat,lng,country,tag_similarity
122627,9.4,Rosewood London,1008,51.517330,-0.118097,0,1.000000
85479,9.3,Hilton London Bankside,2319,51.505696,-0.101525,0,1.000000
178958,9.0,Andaz London Liverpool Street,1283,51.517283,-0.081245,0,1.000000
246911,8.6,Mercure London Hyde Park,527,51.515115,-0.174386,0,1.000000
256757,8.3,Sofitel Paris Baltimore Tour Eiffel,420,48.866309,2.289609,1,1.000000
37337,9.4,Lansbury Heritage Hotel,82,51.509099,-0.015730,0,0.816497
163269,9.3,H tel Saint Marc,377,48.870886,2.338213,1,0.816497
124529,9.2,Draycott Hotel,245,51.493010,-0.159715,0,0.816497
481702,9.2,Armani Hotel Milano,835,45.470532,9.193020,2,0.816497
483570,9.2,Hotel Berna,4017,45.482669,9.203437,2,0.816497

In [351]:
import math
def distance(lat1, lon1, lat2, lon2):
    radius = 6371
    dlat = math.radians(lat2-lat1)
    dlon = math.radians(lon2-lon1)
    a = math.sin(dlat/2) * math.sin(dlat/2) + math.cos(math.radians(lat1)) \
        * math.cos(math.radians(lat2)) * math.sin(dlon/2) * math.sin(dlon/2)
    c = 2 * math.atan2(math.sqrt(a), math.sqrt(1-a))
    d = radius * c
    return d

In [352]:
from geopy.geocoders import Nominatim

In [353]:
def calcLatLang(loc):
    gl = Nominatim(user_agent="hotel-recsys")
    location = gl.geocode(loc)
    return location.latitude, location.longitude

In [354]:
lat2, lon2 = calcLatLang("Eiffel Tower")

In [355]:
hotel_dist = []
for lat1, lon1 in zip(final_hotels.lat, final_hotels.lng):
     hotel_dist.append(distance(lat1,lon1,lat2,lon2))
final_hotels.drop(['lat', 'lng'], axis=1, inplace=True)
final_hotels['distance'] = hotel_dist
final_hotels.drop(['total_reviews', 'country', 'tag_similarity'], axis=1, inplace=True)

## Distance Based Recommendation

In [356]:
final_hotels.sort_values(by='avg_score', ascending=False).sort_values(by='distance').head(10)

        avg_score                              name  distance
76390         8.6         Pullman Paris Tour Eiffel  0.329445
99600         8.0  Mercure Paris Centre Tour Eiffel  0.409955
247299        8.9                        Derby Alma  0.515151
17806         9.3            Shangri La Hotel Paris  0.610981
159365        8.0                  Eiffel Trocad ro  0.689919
218145        8.4                  Hotel Sezz Paris  0.699652
55265         8.8                 Le Marquis Eiffel  0.775675
17380         8.6               H tel Juliana Paris  0.808269
35442         8.8           H tel de la Bourdonnais  0.819728
255024        9.0               La Clef Tour Eiffel  0.834632

In [357]:
reviewsDF = df.groupby('Hotel_Name').agg({'Negative_Review': ', '.join,'Positive_Review': ', '.join}).reset_index()
reviewsDF['NegPos'] = reviewsDF.Positive_Review.astype(str) + reviewsDF.Negative_Review.astype(str)
reviewsDF

,Hotel_Name,Negative_Review,Positive_Review,NegPos
0,11 Cadogan Gardens,Thought the prise of drinks at the bar a litt...,We were particularly impressed by the very wa...,We were particularly impressed by the very wa...
1,1K Hotel,Air conditioning in room didn t work and desp...,Location good close to le Marais and 3e arron...,Location good close to le Marais and 3e arron...
2,25hours Hotel beim MuseumsQuartier,Breakfast not included and buffet really expe...,Cool vintage style in the middle of the museu...,Cool vintage style in the middle of the museu...
3,41,"There wasn t a thing that we didn t like , No...",Its central proximity close to all services a...,Its central proximity close to all services a...
4,45 Park Lane Dorchester Collection,More kinds of fruit juice will make the mini ...,Everything here are almost perfect the staffs...,Everything here are almost perfect the staffs...
...,...,...,...,...
1487,citizenM London Bankside,This was our third stay at this hotel and it ...,"No Positive, What an amazing and unique hotel...","No Positive, What an amazing and unique hotel..."
1488,citizenM London Shoreditch,Lifts need reprogramming exasperating journey...,Swift auto check in Good bar and lounge area ...,Swift auto check in Good bar and lounge area ...
1489,citizenM Tower of London,"Rooms are small but well designed, breakfast...",The use of technology was impressive UBS outl...,The use of technology was impressive UBS outl...
1490,every hotel Piccadilly,The hotel overall requires an update furnitur...,The location was the only great aspect of thi...,The location was the only great aspect of thi...
1491,pentahotel Vienna,Slightly high prices at the bar and odd smell...,The staff and room were fantastic The hotel i...,The staff and room were fantastic The hotel i...

In [358]:
reviewsDF[pd.isnull(reviewsDF).any(axis=1)]

Empty DataFrame
Columns: [Hotel_Name, Negative_Review, Positive_Review, NegPos]
Index: []

In [359]:
from sklearn.feature_extraction.text import TfidfVectorizer

In [360]:
tfidf = TfidfVectorizer(stop_words='english')

In [361]:
tfidf_matrix = tfidf.fit_transform(reviewsDF.NegPos)

In [362]:
tfidf_matrix.shape

(1492, 81002)

In [363]:
contentSimilarity = linear_kernel(tfidf_matrix, tfidf_matrix)

In [364]:
indices = pd.Series(reviewsDF.index, index=reviewsDF['Hotel_Name']).drop_duplicates()

In [365]:
def get_similar_hotels(name):
    idx = indices[name]
    scores = list(enumerate(contentSimilarity[idx]))
    scores = sorted(scores, key=lambda x:x[1], reverse=True)[1:11]
    similar_hotels = [i[0] for i in scores]
    return reviewsDF.Hotel_Name.iloc[similar_hotels]

## Review Content Based Recommendation

In [366]:
get_similar_hotels('Hotel Arena')

1145            Park Plaza Vondelpark Amsterdam
182                 Boutique Hotel Notting Hill
126               Best Western Blue Tower Hotel
173                     Bilderberg Garden Hotel
789                      Hotel Vondel Amsterdam
495          Hampshire Hotel Amsterdam American
362                Grand Hotel Amr th Amsterdam
39                             Amadi Park Hotel
1140                Park Plaza London Riverbank
819     INK Hotel Amsterdam MGallery by Sofitel
Name: Hotel_Name, dtype: object